# Taps
tap "homebrew/bundle"
tap "owenthereal/upterm"
tap "phasehq/cli"
tap "oven-sh/bun"

# CLI Tools
brew "ansible"
brew "asciinema"
brew "awscli"
brew "bash"
brew "bat"
brew "bfg"
brew "oven-sh/bun/bun"
brew "cowsay"
brew "curl"
brew "deno"
brew "diff-so-fancy"
brew "direnv"
brew "dockutil"
brew "doctl"
brew "exiftool"
brew "eza"
brew "fabric-ai"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-crypt"
brew "gnupg"
brew "go"
brew "helm"
brew "highlight"
brew "httpie"
brew "htop"
brew "hugo"
brew "hyperfine"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "jwt-cli"
brew "k9s"
brew "kubectx"
brew "libpng"
brew "libssh"
brew "libssh2"
brew "libtiff"
brew "mas"
brew "mise"
brew "mtr"
brew "neovim"
brew "nmap"
brew "node"
brew "ollama"
brew "openssl"
brew "pgcli"
brew "phasehq/cli/phase"
brew "pinentry-mac"
brew "pipx"
brew "postgresql"
brew "python"
brew "redis"
brew "ripgrep"
brew "rust"
brew "speedtest-cli"
brew "ssh-copy-id"
brew "starship"
brew "terminal-notifier"
brew "terraform"
brew "thefuck"
brew "tig"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "unar"
brew "owenthereal/upterm/upterm"
brew "vim"
brew "watchman"
brew "wget"
brew "yq"
brew "yt-dlp"
brew "zsh"
brew "zsh-syntax-highlighting"

# Casks (GUI Apps)
cask "1password-cli"
cask "alfred"
cask "brave-browser"
cask "claude"
cask "cursor"
cask "discord"
cask "docker"
cask "firefox"
cask "ghostty"
cask "google-chrome"
cask "handbrake"
cask "iterm2"
cask "little-snitch"
cask "lm-studio"
cask "ngrok"
cask "obs"
cask "obsidian"
cask "omnidisksweeper"
cask "orbstack"
cask "postman"
cask "rectangle"
cask "signal"
cask "slack"
cask "spotify"
cask "tailscale"
cask "tableplus"
cask "visual-studio-code"
cask "vlc"
cask "voiceink"
cask "whatsapp"
cask "wireshark"
cask "xquartz"
cask "zed"
cask "zoom"

# Fonts
cask "font-meslo-for-powerline"
cask "font-m-plus-1"
cask "font-roboto"

# Mac App Store
mas "Xcode", id: 497799835
mas "Things", id: 904280696
mas "Tomato 2", id: 1168153231
mas "Amphetamine", id: 937984704
mas "Kindle", id: 302584613
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "ImageOptim", id: 1246969117
mas "AudioBookBinder", id: 413969927
